Revit 2024 API
KeyBasedTreeEntriesLoadResults Methods
The KeyBasedTreeEntriesLoadResults type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFailureMessages
 Get all error or warnings created while attempting to load KeyBasedTreeEntries.
GetFileReadErrors
 Gets the names of any files which could not be read due to access errors.
GetFileSyntaxErrors
 Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetKeyBasedTreeEntryErrors()
 Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors.
GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType)
 Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace